Show / Hide Table of Contents
Class ReinfFabric
Representing fabric reinforcement in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Reinforcement
ReinfFabric
Inherited Members
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass(typeof(Reinforcement))]
public class ReinfFabric : Reinforcement
Constructors
Improve this Doc   View Source
ReinfFabric()
constructor
Declaration
public ReinfFabric()
Properties
Improve this Doc   View Source
Angle
Rotation of fabric reinforcement related to global X coordinate
Declaration
public double Angle { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Cover
Cover of reinforcement
Declaration
public double Cover { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
CoverFromSetting
Use cover from DetailModelSetting
Declaration
public bool CoverFromSetting { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
DiameterX
Bar diameter - direction X
Declaration
public double DiameterX { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DiameterY
Bar diameter - direction Y
Declaration
public double DiameterY { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DistanceX
Distance between bars - direction X
Declaration
public double DistanceX { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DistanceY
Distance between bars - direction Y
Declaration
public double DistanceY { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MasterComponent
Master component of reinforcement, if null, fabric reinforcement is in all components
Declaration
public ReferenceElement MasterComponent { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
Number
number of fabric in wall projection
Declaration
public int Number { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Position
Position of bottom left corner of fabric reinforcement related to point number 1 of master wall
Declaration
public Vector3D Position { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
SeparatelyPerWall
true - add fabric reinfrocement separatelly for each wall, false - merge walls and add reinforcement on merged shape
Declaration
public bool SeparatelyPerWall { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source